
&НаКлиенте
Процедура ВыбратьВрача(Команда)
	
	ОткрытьФорму("Обработка.АРМ_ЗаписьКВрачу.Форма.ФормаЗаписиПоВрачу",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДату(Команда)
	
	ОткрытьФорму("Обработка.АРМ_ЗаписьКВрачу.Форма.ФормаЗаписиПоДате",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНаправление(Команда)
	
	ПоказатьПредупреждение(, "Раздел в разработке. Здесь будет предложено выбрать врача по специализации");
	
КонецПроцедуры

&НаКлиенте
Процедура МоиВрачи(Команда)
	
	ПоказатьПредупреждение(, "Раздел в разработке. Здесь будет предложено выбрать последних посещаемых врачей за предыдущие 3 месяца");
	
КонецПроцедуры
