
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПациент) Тогда
		
		Отказ = Истина;
		Возврат;
	
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаЗаписи") Тогда 
	
		ДатаЗаписи = Параметры.ДатаЗаписи;	
	
	КонецЕсли; 
		
	ТекущийПациент = ПараметрыСеанса.ТекущийПациент;
	
	ЗаполнитьДанныеРецептов();

	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРецептовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаРецептов.ТекущиеДанные;
	Элементы.ТаблицаСоставаРецептов.ОтборСтрок = Новый ФиксированнаяСтруктура("ИДДокумента", ТекущиеДанные.ИДДокумента); 
	Элементы.ТаблицаЦенРецептов.ОтборСтрок = Новый ФиксированнаяСтруктура("ИДДокумента", ТекущиеДанные.ИДДокумента); 
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.СоставРецепта;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеРецептов()

	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.РецептыПациента;

	Результат = Неопределено;
	
	Если НЕ ОперацииWS.ВыполнитьОперацию("ПолучитьДанныеРецептовПациента", 
		Новый Структура("snils", 
			ТекущийПациент.СНИЛС), Результат) Тогда
		
		Если Результат <> Неопределено Тогда
			СтрокаОписанияРезультата = Результат.ОписаниеОшибки;
		КонецЕсли; 
		
	КонецЕсли;
	
	
	Если Результат = Неопределено
		ИЛИ Результат.ЕстьОшибки Тогда
		
		ДоступностьЭлементов = Ложь;
		Возврат;
		
	Иначе
		
		ТаблицаРецептов.Очистить();
		
		Для каждого СтрокаРецептов Из Результат.ТаблицаРецептов Цикл
			
			СтрокаТаблицы = ТаблицаРецептов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаРецептов);
		
		КонецЦикла; 
		
		Для каждого СтрокаЛекарств Из Результат.ТаблицаЛекарств Цикл
			
			СтрокаТаблицы = ТаблицаСоставаРецептов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаЛекарств);
		
		КонецЦикла; 
		
		Для каждого СтрокаЦен Из Результат.ТаблицаЦен Цикл
			
			СтрокаТаблицы = ТаблицаЦенРецептов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаЦен);
		
		КонецЦикла; 
				
	КонецЕсли; 
	
КонецПроцедуры // ()


&НаКлиенте
Процедура КупитьПакет(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ЦеныПоРецептам;
	
КонецПроцедуры


&НаКлиенте
Процедура КРецептам(Команда)
		
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.РецептыПациента;

КонецПроцедуры
 
