
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПациент) Тогда
		
		Отказ = Истина;
		Возврат;
	
	КонецЕсли; 
	
	ТекущийПациент = ПараметрыСеанса.ТекущийПациент;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьсяКВрачу(Команда)
	
	ОткрытьФорму("Обработка.АРМ_ЗаписьКВрачу.Форма.ФормаВыбораВидаЗаписи",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьсяКВрачуДекорацияНажатие(Элемент)
	
	ОткрытьФорму("Обработка.АРМ_ЗаписьКВрачу.Форма.ФормаВыбораВидаЗаписи",, ЭтотОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПосещенийДекорацияНажатие(Элемент)
	
	ПоказатьПредупреждение(, "В разработке. Здесь будет отображаться история посещений");
	
КонецПроцедуры
