
Функция ВыполнитьОперацию(ИмяОперации, Параметры, Результат = Неопределено) Экспорт

	Результат = Неопределено; 
	ТекстОшибки = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Параметры);
	СтрокаПараметров = ЗаписьXML.Закрыть();
	
	Прокси = ОбменДаннымиПовтИсп.ПолучитьПрокси(ТекстОшибки);
	Если Прокси = Неопределено Тогда
		Результат = Новый Структура("ЕстьОшибки, ОписаниеОшибки", Истина, ТекстОшибки); 
		Возврат Ложь;
	КонецЕсли;
	
	ЗначениеРезультата = Прокси.sendOperation(ИмяОперации, СтрокаПараметров);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ЗначениеРезультата);
	Результат = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	
	ЧтениеXML.Закрыть();
	
	Если Результат.ЕстьОшибки Тогда
		Возврат Ложь;
	КонецЕсли; 
	Возврат Истина;

КонецФункции // ВыполнитьОперацию()
 
Функция ПодготовитьДанные(ИмяОперации, Результат = Неопределено) Экспорт
	
	ТекстОшибки = "";
	
	Прокси = ОбменДаннымиПовтИсп.ПолучитьПрокси(ТекстОшибки);
	Если Прокси = Неопределено Тогда
		Результат = Новый Структура("ЕстьОшибки, ОписаниеОшибки", Истина, ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	ЗначениеРезультата = Прокси.prepareData(ИмяОперации);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ЗначениеРезультата);
	Результат = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	
	ЧтениеXML.Закрыть();
	
	Если Результат.ЕстьОшибки Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции // ПодготовитьДанные()

