

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПациент) Тогда
		
		Отказ = Истина;
		Возврат;
	
	КонецЕсли; 
	
	Если Параметры.Свойство("Врач") Тогда
		Врач = Параметры.Врач;	
	КонецЕсли; 
	
	ТекущийПациент = ПараметрыСеанса.ТекущийПациент;
	
	ЗаполнитьДатыВрачей();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДатыВрачей()

	Результат = Неопределено;
	ТаблицаДат.Очистить();
	
	ПараметрыОперации = Новый Структура("snils", ТекущийПациент.СНИЛС);
	Если ЗначениеЗаполнено(Врач) Тогда
		ПараметрыОперации.Вставить("Врач", Врач);
	КонецЕсли; 
	
	Если НЕ ОперацииWS.ВыполнитьОперацию("ПолучитьДатыВрачей", ПараметрыОперации, Результат) Тогда 
		
		Если Результат <> Неопределено Тогда
			СтрокаОписанияРезультата = Результат.ОписаниеОшибки;
		КонецЕсли; 
		
	КонецЕсли;
	
	Если Результат = Неопределено
		ИЛИ Результат.ЕстьОшибки Тогда
		
		ДоступностьЭлементов = Ложь;
		
	Иначе
		
		Если Результат.Свойство("ТаблицаДат") Тогда
			
			Для каждого СтрокаТаблицы Из Результат.ТаблицаДат Цикл
				
				СтрокаДат = ТаблицаДат.Добавить();
				СтрокаДат.Дата = СтрокаТаблицы.Дата;
							
			КонецЦикла; 
		
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры // ЗаполнитьФормуПоВрачамПациента()

&НаКлиенте
Процедура ТаблицаДатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДатаЗаписи = Элементы.ТаблицаДат.ТекущиеДанные.Дата;
	
	Если НЕ ЗначениеЗаполнено(Врач) Тогда
		
		ПараметрыОткрытия = Новый Структура("ДатаЗаписи, Желаемая", ДатаЗаписи, Ложь);
		ОткрытьФорму("Обработка.АРМ_ЗаписьКВрачу.Форма.ФормаЗаписиПоВрачу", ПараметрыОткрытия,
			ЭтотОбъект);
			
	Иначе
			
			
		ПараметрыОткрытия = Новый Структура("Врач, ДатаЗаписи, Желаемая", Врач, ДатаЗаписи, Ложь);
		ОткрытьФорму("Обработка.АРМ_ЗаписьКВрачу.Форма.ФормаРезультатаЗаписи", ПараметрыОткрытия,
			ЭтотОбъект);
		
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаписиВыбор(Элемент, ВыбраннаяДата)
	
	ПараметрыОткрытия = Новый Структура("Врач, ДатаЗаписи, Желаемая", Врач, ДатаЗаписи, Ложь);
	ОткрытьФорму("Обработка.АРМ_ЗаписьКВрачу.Форма.ФормаРезультатаЗаписи",
		ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()

	Элементы.ТаблицаДат.Видимость = Ложь;
	Элементы.ДатаЗаписи.Видимость = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Врач) Тогда
		
		Элементы.ДатаЗаписи.Видимость = Истина;
		
	Иначе
		
		Элементы.ТаблицаДат.Видимость = Истина;
		
	
	КонецЕсли; 
	
КонецПроцедуры // УстановитьВидимостьДоступность()
 

 

