
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос(ТекстЗапросаАвторизованныхПользователей());
	ТаблицаАвторизованных = Запрос.Выполнить().Выгрузить();
	
	Элементы.ГруппаВход.Видимость = Ложь;
	Элементы.ГруппаАвторизованные.Видимость = Ложь;
	
	Если ТаблицаАвторизованных.Количество() = 0 Тогда
		
		Элементы.ГруппаВход.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаАвторизованные.Видимость = Истина;
		
		//Элементы.Авторизован1.Видимость = Ложь;
		//Элементы.Авторизован2.Видимость = Ложь;
		//Элементы.Авторизован3.Видимость = Ложь;
		Элементы.АвторизованДекорация1.Видимость = Ложь;
		Элементы.АвторизованДекорация2.Видимость = Ложь;
		Элементы.АвторизованДекорация3.Видимость = Ложь;
		
		
		
		Сч = 1;
		Для каждого СтрокаАвторизованных Из ТаблицаАвторизованных Цикл
			
			Если Сч > 3 Тогда
			
				Прервать;
			
			КонецЕсли; 
			
			СтрокаАвторизованного = Авторизованные.Добавить();
			СтрокаАвторизованного.Пациент = СтрокаАвторизованных.Пациент;
			СтрокаАвторизованного.Номер = Сч;
			//Элементы["Авторизован" + Сч].Заголовок = Строка(СтрокаАвторизованных.Пациент);
			//Элементы["Авторизован" + Сч].Видимость = Истина;
			Элементы["АвторизованДекорация" + Сч].Заголовок = Строка(СтрокаАвторизованных.Пациент);
			Элементы["АвторизованДекорация" + Сч].Видимость = Истина;
			
			Сч = Сч + 1;
			
		КонецЦикла; 
		
		
	КонецЕсли; 
		
КонецПроцедуры


&НаКлиенте
Процедура Войти(Команда)
	
	Если НЕ ЗначениеЗаполнено(СНИЛС) Тогда
		
		ПоказатьПредупреждение( ,"Необходимо указать снилс!");
		
	КонецЕсли; 
	
	ВыполнитьВходНаСервере();
	
	Если ВходВыполнен Тогда
		
		ОткрытьФорму("Обработка.АРМ.Форма.ФормаВыбораОпераций", , ЭтотОбъект);
	
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВходНаСервере()
	
	Результат = Неопределено;
	Если НЕ ОперацииWS.ВыполнитьОперацию("Логин", Новый Структура("snils", СНИЛС), Результат) Тогда
		Если Результат <> Неопределено Тогда
			СтрокаОписанияРезультата = Результат.ОписаниеОшибки;
		КонецЕсли; 
	КонецЕсли;
	
	Если Результат = Неопределено
		ИЛИ Результат.ЕстьОшибки Тогда
		
		ДоступностьЭлементов = Ложь;
		
	Иначе
		
		Пациент = Справочники.Пациенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Результат.ПациентУИД));
		Если НЕ ЗначениеЗаполнено(Пациент)
			ИЛИ Пациент.ПолучитьОбъект() = Неопределено Тогда
			
			НовыйПациент = Справочники.Пациенты.СоздатьЭлемент();
			НовыйПациент.Наименование = Результат.НаименованиеПациента;
			НовыйПациент.СНИЛС = СНИЛС;
			НовыйПациент.УстановитьСсылкуНового(Пациент);
			НовыйПациент.Записать();

		КонецЕсли;
		
		ПараметрыСеанса.ТекущийПациент = Пациент;
		
		МенеджерЗаписи = РегистрыСведений.АвторизованныеПользователи.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пациент = Пациент;
		МенеджерЗаписи.Записать();
		
		ВходВыполнен = Истина;
		
	КонецЕсли; 

КонецПроцедуры // ВыполнитьВходНаСервер()
 

&НаСервере
Процедура НовыйПациентНаСервере()
	
	СНИЛС = "";
	Элементы.ГруппаВход.Видимость = Истина;
	Элементы.ГруппаАвторизованные.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйПациент(Команда)
	
	НовыйПациентНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаАвторизованныхПользователей()

	Возврат 
	"ВЫБРАТЬ
	|	АвторизованныеПользователи.Пациент КАК Пациент
	|ИЗ
	|	РегистрСведений.АвторизованныеПользователи КАК АвторизованныеПользователи";

КонецФункции // ()

&НаСервере
Процедура АвторизованНаСервере(Значение)
	
	ВходВыполнен = Ложь;
	СтрокиАвторизованных = Авторизованные.НайтиСтроки(Новый Структура("Номер", Значение));
	Если СтрокиАвторизованных.Количество() > 0 Тогда
		ПараметрыСеанса.ТекущийПациент = СтрокиАвторизованных[0].Пациент;
		ВходВыполнен = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизованНаКлиенте(Значение)

	АвторизованНаСервере(Значение);
	
	Если ВходВыполнен Тогда
		
		ОткрытьФорму("Обработка.АРМ.Форма.ФормаВыбораОпераций", , ЭтотОбъект);
	
	КонецЕсли; 
	

КонецПроцедуры // ()
 

&НаКлиенте
Процедура Авторизован1(Команда)
	АвторизованНаКлиенте(1);
КонецПроцедуры

&НаКлиенте
Процедура Авторизован2(Команда)
	АвторизованНаКлиенте(2);
КонецПроцедуры

&НаКлиенте
Процедура Авторизован3(Команда)
	АвторизованНаКлиенте(3);
КонецПроцедуры


&НаСервере
Процедура ЗабытьВсехНаСервере()
	
	НаборРегистра = РегистрыСведений.АвторизованныеПользователи.СоздатьНаборЗаписей();
	НаборРегистра.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗабытьВсех(Команда)
	ЗабытьВсехНаСервере();
	НовыйПациент(Неопределено);
КонецПроцедуры

