&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПациент) Тогда
		
		Отказ = Истина;
		Возврат;
	
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаЗаписи") Тогда
		
		ДатаЗаписи = Параметры.ДатаЗаписи;
	
	КонецЕсли; 
	
	Если Параметры.Свойство("Врач") Тогда
		
		Врач = Параметры.Врач;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Врач) Тогда
	
		Специализация = Врач.Специализация;	
	
	КонецЕсли; 
	
	ТекущийПациент = ПараметрыСеанса.ТекущийПациент;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьНажатие(Элемент)
	
	ПодтвердитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьНаСервере()

	Результат = Неопределено;
	
	Если НЕ ОперацииWS.ВыполнитьОперацию("ВыполнитьЗаписьНаПрием", 
		Новый Структура("snils, ДатаЗаписи, Врач, ЖелаемаяДата, ОтпарвлятьОповещения", 
			ТекущийПациент.СНИЛС,
			ДатаЗаписи,
			Врач,
			ЖелаемаяДата,
			ПодписатьсяНаОповещение
			
		), Результат) Тогда
		
		Если Результат <> Неопределено Тогда
			СтрокаОписанияРезультата = Результат.ОписаниеОшибки;
		КонецЕсли; 
		
	КонецЕсли;
	
	
	Если Результат = Неопределено
		ИЛИ Результат.ЕстьОшибки Тогда
		
		ДоступностьЭлементов = Ложь;
		Возврат;
		
	Иначе
		
		Если Результат.Свойство("ОписаниеДанных") Тогда
			
			СтрокаОписанияРезультата = Результат.ОписаниеДанных;
			                                  		
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры // ()
 

